app/controllers/album_controller.rb

  def view

    @album=params[:album]
    @songs=Song.find(:all, :conditions => {:album => @album} )
---
SELECT * FROM `songs` WHERE (`songs`.`album` = 'Ladies & Gentlemen: For The Feet')

  def index


    # the new paginated way
    @albums=Song.paginate :page => params[:page], :per_page => 50, :select => "album,artist", :group => "album", :order => 'album'
---
SELECT album,artist FROM `songs` GROUP BY album ORDER BY album LIMIT 0, 50
SELECT count(*) AS count_all, album AS album FROM `songs` GROUP BY album