app/controllers/artist_controller.rb

  def view

    @artist=params[:artist]
    @songs=Song.find(:all, :conditions => {:artist => @artist})
---
SELECT * FROM `songs` WHERE (`songs`.`artist` = 'Underworld') ORDER BY album,track

  def index
    # @artists=Song.find(:all, :select => "artist", :group => "artist")
    # @users = User.paginate :page => params[:page], :order => 'name'
    @artists=Song.paginate :page => params[:page], :select => "artist", :group => "artist", :order => 'artist'
---
SELECT artist FROM `songs` GROUP BY artist ORDER BY artist LIMIT 0, 30
SELECT count(*) AS count_all, artist AS artist FROM `songs` GROUP BY artist