app/controllers/songs_controller.rb

SELECT * FROM `songs` WHERE (`songs`.`id` IS NULL)
---
  def view

    @show_song = Song.find(params[:id])

SELECT count(*) AS count_all FROM `songs`
SELECT title FROM `songs` ORDER BY title LIMIT 0, 50
---
  def index


    # the new paginated way
    @songs=Song.paginate :page => params[:page], :per_page => 50, :select => "*", :order => 'title'